[
  "Ross' anger issues are so chaotic and relatable, best thing about this iconic character ever",
  "\"Hey Ross. What's up, bro?\" gets me every time.",
  "\"I'll prove it like a theorem\" will always make me burst out laughing.",
  "The blow-up between Rachel and Ross over her letter should be on here, Ross was so funny in that scene. \"You don't have to worry about me sleeping because I still have your letter\" was gold",
  "Can’t believe they left out Ross getting a tan. That was one of the best Ross moments. \n\n“I’M AN EIGHT!”",
  "\"Come on, Ross, just forget about the condom.\"\n\n\"Oh, well, I may as WELL have!\"",
  "‘I’m indignant… as a CONSUMER!’",
  "Ross was hilarious when he went all Red Ross .",
  "I like the expression on Ross' face when Rachel told him she was pregnant with his child.",
  "Ross acting is on another level",
  "\"He is the one doing your sister\"",
  "If I had a nickel for every time Ross got his ex wife pregnant I’d have 2 nickels, which isn’t a lot but it’s weird it happened twice",
  "\"Hey Ross, what's up bro\"????",
  "5:00 Rachel and Ross' Pottery Barn convo before Phoebe came was like a regular, agreeable, married couple's conversation",
  "Red Ross was amazing \n\nBest actor in the entire show. Too many iconic funny moments to count",
  "My gosh, David Schwimmer is truly a comedic genius!",
  "Mental Geller",
  "\" My sandwich\" is missing .... Also \" We were on a break\" and slashs the door",
  "Here comes the Divorce Force AGAIN",
  "When Ross finds out the relation between Chandler & Monica, The mood swing from angry to happy is wild . & David's acting nails it.",
  "David Schwimmer Is the best of the cast... So hilarious",
  "“What are you doing?! GET OFF MY SISTER!!!!”",
  "\"YEAH I'LL PRESS ONE\"",
  "To me he was the funniest of the entire show",
  "6:47 I GOT IT AT POTTERY BARN OK!?!  One of favorite ross screams.",
  "the way he presses \"1\" 4:28 , hahahahahahahahahhahhahahaahah",
  "david was mvp acting wise. really talented actor",
  "I am him. I know ppl hate on Ross, but i found him the most relatable",
  "Ross is like the most underrated character ever he is sooo funny my absolute favorite friend",
  "\"You know what's not one of a kind\" a twin",
  "Let’s not forget the thanksgiving sandwich episode",
  "HE NEVER MENTIONED A SANDWICH, WTF ARE YOU UPLOADING",
  "Logical step is one thing, but they wont even let you breathe",
  "David schwimmer was underrated. His acting was brilliant",
  "How could you leave out the thing with the sandwich",
  "David Schwimmer is such an amazing actor.",
  "David Schwimmer was the best actor out of this entire cast!",
  "00:19 I like the \"Bye bye then\" taken from Emily",
  "love to see channels like this becoming the norm. idc if it’s lazy, at least it’s something to watch",
  "What about “you threw my sandwich away - MY SANDWICH”?!",
  "Goodbye goodbye goodbye goodbye g.g.g.g ITS PHYSICALLY IMPOSSIBLE",
  "\"Hey this book is mine\"",
  "He's the one doing your sister",
  "10:12  the mimicking",
  "03:06 his face is hilarious",
  "One of my favorite things in this show is ross getting mad",
  "Lol Ross will always be my favorite lol. Love him. Hilarious.",
  "You have to give David credit for playing petty so well.",
  "Yeah, I'll press 1 !\n\nShe hates Pottery Barn?",
  "That is some great comedic acting by ross",
  "I think as a lot of people know this:\nDavid Schwimmer was the best physical comedy in Friends TV series \nHe does the best work at stage",
  "He is a good actor... He change his character quick",
  "'Ross came as doodie'",
  "The best programme evvvvverrrrr on tv.  I pretty much know them all word for word as watched it when it 1st came on tv. And still watch it now when i want to cheer myself up.",
  "They should put on that box",
  "Just picture Melman doing the lines.",
  "The title \"Red Ross\" would be more appropriate",
  "You left out Ross screaming my sandwich",
  "Schwimmer",
  "I was waiting for Ross and his sandwich",
  "Red Ross.",
  "This would've been even better with the iconic pivot scene",
  "Excuse me, there's an error in the video title. It very clealry should be called \"Red Ross Moments\"",
  "red ross would be a better title for the video",
  "“MY BEST FRIEND AND MY SISTER!!!! \n\n\"my BeSt FrIeNd AnD mY sIsTEr!!!!!\"\n️️",
  "So many legendary moments thanks to Ross/David Schwimmer",
  "The title should’ve been “The One With Red Ross”",
  "The best of them all . Ross is a goat",
  "Brilliant actor",
  "Can't have a Ross heated moments video without the spray tan",
  "Always thought ross was a bit of a hypocrite. It was alright for him to go out with his sisters best mate but not when his best mate went out with his sister.",
  "His 'change from anger to pleasure looks almost like a 'switch', but his character has the ability to forgive, so his sudden acceptance of Chandler is actually just logical. It takes some actor. He should be doing Coward on the stage. J.",
  "I loveeeeeee Ross",
  "Where's the pivot scene ?",
  "Ross is may favourite character after Chandler",
  "MY SANDWICH!!!!!",
  "Why has \"Red Ross\" from the rugby game with Emily's English male friends been omitted? That was the one where he heated up more than any other episode, so hot that he got red!!!",
  "Where is \"You gotta do what band says\"",
  "You know what's not one of a kind? A Twin.",
  "9:35 i get ross’s anger here. He gave her gifts she should keep them and move on. It sounds much more mature.",
  "We were on a breaaaaaak !",
  "de title shouldve been the one wit Red Ross",
  "Should have named the video \"Red Ross\"",
  "Love Ross!!\n\nEasily the funniest character on the show.",
  "David's expressions from Rachel's news are priceless. He truly is a master of his character. Just when you think you know everything there is to know about Ross, David pulls a rabbit out of the hat.",
  "guys u messed the title...it should've been called Red Ross",
  "Rachel: \"It's time to move on. Don't you think?\"\nsome episodes later, Ross is with Bonnie\nRachel: I gotta have him back",
  "Hands down the best actor among the cast... What expressions man",
  "After watching this video I realized Ross was toxic too for the first time",
  "Red Rooosss!!!",
  "Hey Where's the sandwich part you missed it",
  "Poor Ross",
  "David/ROSS",
  "I think you mean “The One Where Ross is Red”",
  "Chandler Monica, Ross, Rachel, Joey, Phoebe friends CONNOR ️‍️‍️‍️‍️‍️‍️‍️‍️‍",
  "Red Ross",
  "You know what I think, I think she’s just weird you know it’s because she a twin, twins are weird  5:44",
  "You have no idea how far it goes. There was a video and my thoughts were predicted 10 minutes straight.",
  "Love how practically all of them are about Rachel",
  "Seems incomplete without the “My sandwich” and “Get off my sister “",
  "Chandlers lucky Ross acted the way he did when he found out He broke the Bro Code and fooled around with Ross's Sister behind his back.",
  "Why didn’t you name this video The one with red ross  Missed opportunity",
  "Red Ross",
  "What do you mean? I'm fine!!!",
  "Don’t you mean “Red Ross?”",
  "Hi Ross what's up  bro l love monica",
  "5:44 this KILLS me",
  "11:24",
  "Havent watched since Chandler passed. RIP dude. Back to Allah we go. Thank you..",
  "you had an opportunity to name a red ross video but look what you did",
  "No way they used the word “heated” like 5 years after it was popular",
  "u ever noticed joeys and ross best friend is chandlier",
  "David Schwimmer is such a good actor.",
  "Like if you think that Ross has the best expressions on the show",
  "Ross has ptsd from WW2",
  "1)WAT DUH HELL WERE U DOING WIT MY SISTER? MY BEST FRIEND N MY SISTER I CANNOT BELIEVE DIS\nlook we re not just messing around i love her\nit its true i love him too\n\nmy best friend n my sister i cannot believe dis  u guys should probably get in here huh big news\n\n nah its ok we already knew\n\nwat?U ALL KNEW N DIDDNT TELL ME \n\nR..Ross we were worried bout u n diddnt know how u were gonna react\n\nMm\n\nU were worried bout me..u diddnt know how i was gonna react",
  "I love Ross",
  "And lets not.. Lets not!!!! Forget about the book keeping of your faults",
  "Red Ross is the best!",
  "Oh boy. Arent you a dog!",
  "Ross wouldn't be possible if he wasn't David Schwimmer.",
  "I miss \"pivot\"",
  "The Ross character was a first class a$$!",
  "Am I the only one who was waiting for \"my sandwich\"",
  "Imagine if joey is doing Monica, Ross would be like\n\nRoss: WHAT ARE YOU DOIN?? GET OFF MY SISTER\nthen goes and frantically fight joey",
  "Joey: “Dude! He’s right there!” 0:48 \n\n2:11 That insane head twist of his is something else. Poor Joey on the receiving end of it!\n\n8:05 Joey instigating shit. What a friend!\n\n10:14 both of them being petty as fuck with their childish humour.",
  "Red Ross!",
  "Red ross",
  "Its 10:44 for me  it kills me every fuckin time",
  "RED ROSSSSSSSSSSSSSSS!!!!!!!!!!!",
  "Ross",
  "Where is \"Red Ross\"?",
  "Heated Ross?\n\nShould have been Red Ross.",
  "Chandler",
  "ROOOS IS HOT",
  "Red ross",
  "I hate Rachel, don't know why!!",
  "If you care about your friend more than your wife...that is not someone you would want to marry",
  "The character Ross is horrible for all the controlling stuff he does, he doesn't have to say anything about the lives of others",
  "I like David but dislike Ross's character vm now grown up i can clearly see he's way too toxic and has a lot of issues man",
  "Ross behaves like a jerk when he gets to know she's pregnant. \nHow has the world successfully fooled American women that the father not taking responsibility for a child is ok??\nWhy's there no pressure on Ross n he can be as involved as he wants and of all people, Rachel tells this to him! Seriously???!",
  "Where is the \"We were on a break\" clip? And the \"My sandwich\" clip? They are the two most iconic Ross's heated scenes. I am disappointed that I couldn't see them!"
]