{
  "comments": [
    "I had to stop using the wired one after a couple years of use, not due to hardware failure but the drivers and software not being updated. I've retried the g600 since then and the EVGA. EVGA has a trash scroll wheel and I tried a replacement as well. First one also started turning it's self off after awhile.I decided to try the wireless version of this since I really liked the wired and the software is newer and seems to be updated. So far I'm happy. Easy to program buttons and macros. Being wireless will take some getting used to since I'm used to having to fight the wire and pull the wire around to move the mouse. It's great but muscle memory still wants to pull the cable. It came already charged and worked before even finding the software/drivers download link. The driver card failed but when I had the old one it worked so I consider that a fluke. I found the software/drivers through their site's FAQ page.It's a bit lighter than I'm used to but it's built well. Smooth clicking and the scroll wheel is smooth and no clicking or grinding or jumping around. I'll update again if anything changes but I expect it to last awhile. The g600 main button would always break after just a year, and EVGA scroll is trash, where as the old one of this held up physically.Old review:I've used a Logitech G600 for many years and when it was finally time to get a replacement I decided to try this on a whim since it was cheap and had the full 12 side buttons. Normally I read lots of reviews and research an item first but I didn't this time. Short answer is it's great and I'm glad I got it.First one negative difference is the ring finger rest. On the G600 that is a button that I could program. It's not been a too big of a deal. I reset those to the trigger button in their profiles but it took some time for my my muscle memory to catch up. My ring finger would still like to do something sometimes.The G600 had clicks left and right on the scroll wheel that could also be programed. I never used this so don't miss it but it's a difference to note.Software: I've seen complaints about the software. Over all it's pretty good. On the G600 I had to enter combo keys to do things like cntrl+W for sprint in a game or close window, and I had to set up a hot key combo for volume up and down with the g600. This allows me to just select the option to walk or close window, and even volume with no extra hot key combos needed to be added. The options are already in the software. I did enter a combo key for closing a tab and it worked fine, once I remembered to hit apply. So to me this seems a lot better as it can more easily do what I want.(this part is not relevant to the wireless pro)A little bug that seems to be a software issue. Sometimes the scroll wheel stops working but if I switch the profile to a different one and back it fixes it. This seems to happen after I've turned the port off but not every time. I turn the port for the mouse off when I leave the room due to pets. So this might not be an issue for most. (this is the issue that got worse later it was either drivers being too old or maybe the cable wearing out)Another minor negative is the G600 could cycle colors as far as I've found you can only select one color with this. (I just leave the lights off on he pro for longer time between charging. It lasts all day that way)Over all I'm very pleased with my purchase(have had it a few months at this time). The roughened texture feels great, the weights help a lot(I have hand tremors and the weight allows for better control). The cable is even better, less stiff. The wheel feels better and looks better. The whole thing just feels and looks good and preforms well with the occasional minor glitch with the wheel.If I were buying today I would select this over the G600, it's cheaper and better.",
    "Buckle up guys, this review is gonna be long,Amazing mouse. I started using it on January 4th, 2018, and here it is, over a year later, still working flawlessly. Not sure what other reviews mean with the software being a nightmare. Literally all I did was search \"utechsmart software\" and it's the first result, it's really straightforward. Now, *claps hands together* m o u s e  r e v i e w !Build quality: 10/10It's grippy and textured, which, when I first got it, seemed odd and kind of weird. That is, until I got used to it, which was very quickly. It has a teflon coating or something that makes your hands not stick to it when your hands get sweaty. It also has adjustable weight, which is a godsend. It feels really solid and makes other, expensive, non textured mice feel like cheap trash. *cough cough* \"I'm looking at you, Razer Naga!\" I've never had a button stick or be unresponsive, and, as hard as I am with them, and as much as I use them, is truly impressive.Ergonomics: 9/10The ergonomics are awesome, when I first got it, I found myself trying to right click by pushing down with my ring finger on the side groove. Speaking of side grooves, I kinda wish they had a groove for your pinky as well as your ring finger, but don't get me wrong, you don't notice it unless you're thinking about it, and the grippy texture almost completely makes up for it by keeping your pinky held up on the side. If you use the claw grip on your mouse though, it just negates it and it's fine, and while this mouse isn't really made for that grip. There's also a thumb rest below the buttons, but once again, it would be nice if it fit my thumb a bit better, it's kinda blocky and not really ergonomic, but not uncomfortable at all, and most of the time, my thumb is on the buttons rather than the rest anyway. Some of you may be worried about how your hands will fit, and fear not! I have huge hands, and this mouse fits me like a glove. Those of you with smaller hands, also fear not! My sister who has small hands has used it and has said it's the best feeling mouse she's used yet! It's basically a one-size-fits-all.Features and usability/functions: 10/10Once you use a mouse with 12 buttons, you can't go back. Believe me, I've tried, and I'm perfectly content with that. I thought there's no way I can keep track of all this, but I did and it's way easier than I thought. This is advertised as an MMO mouse, and I don't even play MMO's, but but I can almost guarantee you will have no regrets. It's completely programmable and I use it for way more things than just gaming. In fact, I'll list all the mapped buttons now just so you can see what I mean.1: Alt+Tab2: Page Down3: Page Up4: Ctrl+Tab (selecting different tabs)5: Volume Down6: Volume Up7: Forward (mouse 5)8: Delete9: Enter10: Backward (mouse 4)11: Ctrl+C (Copy)12: Ctrl+V (Paste)See how useful that is? What sense does it make to have your left hand on a massive keyboard of 100 buttons, and your left only to 2-4 buttons? That's right, it doesn't.Software/Lighing: 8/10The software offers a lot of customizable options, such as DPI, button mapping, and lighting. It's relatively easy to use, and is decently simple. I really wish it had the option of customizing each part of the mouse a different color though, since it has a lot of places for it, or gave the option to breath through different colors, but this is more of a personal thing though. The software offers 5 different profiles, with each profile offering 5 different DPI switches and complete customization of button mapping and lighting etc. The default button to switch is on the underside of the mouse, but is also able to be mapped to any button of your choice.Comparison/price: 10/10This is an all around astounding mouse to have, especially for the price. It easily shatters expensive competitors, like the Razer Naga, even the Trinity version, which I have owned and tried, and falls short in every area, except for the lighting, which is pretty cool. Some people may say the Logitech G600 and G602 mouse is better, and I haven't tried them yet, but for now, I know for a fact that this mouse is the best bang for your buck mouse of this kind you can get. It could easily be sold for 70$+",
    "Overall, great mouse to use for gaming. The left/right click buttons are responsive and feels nice. There are a LOT of button options on this mouse, individually programmable through their software - which they provide via USB (looks like a gift card with the slim USB inserted into it). Once you install the software, you can adjust the colors, sensitivity levels (adjustable via up down arrows under the scroll), button mapping, and lighting. Remember to install the software as the pre-set sensitivity on this mice can be way too much past the first couple settings.. like moving your mouse 1cm moves the cursor like 6 inches on a 1440p monitor. Once you install the software, things work well, even the RGB.Buttons:There are 12 buttons on the side for your thumb, additional button on the left side (image with the circle around it) which highlights all the text - a feature I found was great by the way, sensitivity buttons (the up/down arrows under the scroll), profile button on the bottom of the mouse (can change profiles that are set via software), and a switch on the bottom to turn the mouse off, have it on with RGB or without RGB.Wireless/Wired:The USB for the wireless signal works perfectly. Wireless works just fine with my PC about 3 ft away and under the desk. No issues with stuttering or lag. One great PLUS is that the USB slot under the mouse (to store) is magnetic! It won't fall out and you won't have to worry about losing it. Great little touch.Having the option to go wired is always a plus. Batteries drain $$$ over time and these last for quite a while on a single charge (less with RGB on). The USB C cable they provide is 6 ft long and braided so seems it will be sturdy and last.Durability:They provide you with additional paddings for the bottom of the mouse (the 4 black stickers you can peel/stick) - which is something you usually don't see. If these get bad over time, which I don't believe they will, then you always have another replacement!Buttons seem like they are good quality and will last a while. Clicks are solid, scroll also feels nice - a little resistance but not much, which feels good for me.Comfort:These fit in my hands well. It isn't heavy like some mice out there, but not light either, giving it that premium feel without having to worry about your wrist aching from the weight of it. The plastic around it is textured (slightly bumpy..? Kinda like soft sand paper almost) so even if you sweat your hands won't slip, if that is a worry for some.Things I didn't like:The buttons 1-12 on the side are a bit cramped. It could be my personal taste. I found it hard to really use those well as my thumb would press on multiple or I wouldn't know if I was pressing the middle one or the bottom/top ones. The buttons also are a bit harder to press - not an easy click. Almost as if there is a padding behind it to make some resistance, if that makes sense... If you are looking for a mouse to use 10+ buttons just from the thumb, this may not be the best choice for you. I haven't tried other mice with as many buttons so I can't comment too much on that.",
    "I own two of the previous wired model of this mouse (work & home).  I love it.  My wife bough the wireless version recently and loved it as well.  I then bought the wireless version for work so I wouldn't have to have my \"go to meetings mouse\" in addition to my main wired mouse.  The pricing (on both versions) is also very reasonable.There are good & bad between the models.  There are aspects to the new software that I like and some that I dislike.  The wired version was hampered by having to use older software to get all the functionality.  This one can use the new software.Lighting:There are additional lighting effects that were not available on the wired version.  These features are still lacking in variety and options, but that is a minor complaint.  Specifically, while plugged in it pulses a color (based on battery charge) rather than the light setting chosen.  I'd love to just use it wired when at my desk and wireless when off to meetings and such.  I love the light color cycling and miss that when it is plugged in.Weight Compartment:The wired version had the bottom compartment with additional weights.  This version is lacking that and thus a bit lighter than I am used to.  While I liked the heavier weight it isn't a deal breaker for me.Software:The software, while newer, has fewer options for programming the keys compared to the older version.  The older version had a ton of pre-made keys that were easy and available.  You can get to the same functionality, but you have to add them as key combinations.  An example was the old software had a pre-done entry for copy, paste, and other basic functions.  On this one I had to manually create a \"ctrl + c\" hotkey.  Again, not a huge issue for me, but I could see it being less useful for others who may not have an idea of what to put on all the keys.  It certainly felt like a step backwards on that aspect.  I suspect this has to do with them storing the profile on the mouse directly rather than in a file.Profiles:The software not having the profiles or way to toggle between them was odd.  There is no indicator for which profile you are on.  The button on the bottom to toggle profiles just felt odd as well.  This might be worth the trade-off for having the two profiles on the mouse though.  I absolutely hated that I couldn't convert my current profile onto the new mouse (.pdf profile in older version vs .jmk in this one).  This forced me to re-create all my macros and re-assign them.  Again, not a deal breaker as it is a one time setup and only impacts people with prior versions.  Note, the software is PC only.  You can set the mouse up on a Windows machine, it stores the profiles on the mouse, then you can use the mouse without issue on a Mac.Misc:The slot for the dongle on the bottom of the mouse is a bit odd.  It sticks out just far enough that you can't use the mouse with the wired charger while the dongle is put in the mouse for storage.  I don't understand why they didn't do the recessed tabs on top/bottom of it so you could grip it to pull the dongle out (like most other dongle storage layouts are).  I suspect it is mostly a non-issue since you don't remove the dongle while you have it plugged in, it just seemed like an odd design choice (maybe something they can fix in the next hardware revision/version).The Good:Good size that fits hand very comfortably with the nice textured finishGood quantity of buttons to programHigh precision with adjustable DPI to get mouse movements just rightMultiple profiles for different tasksBetter lighting options compared to prior versionsprofiles stored on mouse (limit 2)The Less Good:no additional weight compartment in wireless version (wired version has it)lighting options, while better, are still underwhelminglighting option when plugged in is not existentless pre-created macro/key options in software compared to earlier versions (can manually create for functionality, just lose the ease of it)The Badnothing that would sway my purchase decisionSummary:This is a great mouse for the price.  It is very comfortable to use and ticks off all the quality items needed for a functional mouse for gaming or customization of buttons.  The software is its greatest weakness, but not detrimental to the point where it has a functional impact (just the area they should focus more effort on).  I back this up with this wireless mouse version being my third of this style/brand of mouse for my own use (2 wired, 1 wireless) plus my wife's use of both the wired and wireless version too.Mac users need to be aware of the software limitation so they can get it setup on a Windows machine first, then they'll be ready to go.",
    "This is the best mouse design I've ever owned, I think, with some trouble spots I'll get into. The macros on the side are easy to use with thumb; the most important buttons I've found to set up being back (alt+left) on key 4, forward (alt+right) on key 1, close tab (ctrl+w) on key 6, open tab (ctrl+t) on key 3, and an autoclicker macro on key 13. I find this to be very ergonomic for browsing and probably could no longer go back to having to use a keyboard to work in a web browser; these keys are also widely used for other applications and inside Windows (e.g. File Explorer). I found the compatible macro software to be pretty intuitive. It's easy to toggle off the RGB lighting with a button on the mouse itself.The left-click button failed on me after around 3.5 years, was no longer able to click and drag. This is not a bad lifespan at all for a mouse I use every single day (excepting maybe one week per year), and I should point out the battery still holds charge just fine, too, which I find impressive. I think my bigger concern is that it's very difficult to clean this mouse, particularly the scroll wheel, which on mine is often filthy and I need to use a pick to clean it out. You can't remove any of the parts. All the parts are still intact and functioning well outside the click mechanism failing on one button, though; notably, all the rubber pads on the bottom remain attached and in good condition, could've lasted another 3.5 years, I think.I re-ordered one, and if it weren't for battery lifespan issues, I'd order 20 and be done for life on ordering mice.",
    "The mouse works great:The cord is durable and long.The software is very easy to use.The style is customizable and gorgeous.The price is low.The programmable buttons even allow for you to make timed single button macros at ease.Support is top notch: I purchased the mouse and about a year later one of the buttons stopped work. I contacted support and within a day they had replied, and sent me a replacement mouse at no charge to myself. Sadly that item had been damaged in the shipping, so they sent a 3rd mouse, again at no charge to myself. I always wait a while before giving a review to make sure it is a real review.I am giving this great review because they deserve it and this item really is great.",
    "Upon my initial browsing of this product, I was a tad worried that I was \"settling\" for one due to its cheaper price than other similar programmable mice, however I was stunned at its quality!Before even testing the mouse, I must say I found it quite ingenious and even a bit cute at how the drivers were included in such an awesome and unexpected way!  They also include a direct link within to their page with an offer for an additional \"thank you!\" product, though I personally haven't gotten around to that yet.The mouse itself has a great feel; compared to my Logitech G600, I actually find the size of this mouse to be much comfier as well as the locations of the grooves for the fingers (the added thumb rest is an amazing luxury).  I have skinny hands that are long and lanky, and so they take up a lot of space anyways and this mouse caters to that quite well!  While the weight of the mouse isn't very heavy, it still has enough to it that it won't go flying across your pad if you are gaming.The programmable buttons are also positioned in a way that is less strenuous on my thumbs to access them quickly, and I do so VERY often with the keys I have programmed them for.  The scroll wheel has no right/left side button functionality, but that's hardly a deal breaker with it being a rare find nowadays to begin with.  The lights are, of course, a GORGEOUS display on my station, and you can set them to only engage if a button is pressed or the mouse is moved.The program itself is also intuitive, user friendly, and quite simple to use, providing quick and easy access to all of the programmable functions for the mouse.  I personally prefer to have my mouse wired straight to my computer, so I can't talk much on the battery life, but the cable is indeed of a nice, high quality fiber-wrapped material and I haven't had it loop or bunch up on me very often at all!There are a few downsides, however: to switch the programmed profiles, the button for this is on the bottom of the mouse, which could be annoying to some who can't fit all of their keys onto one profile and need to switch regularly.  The other downside--to me personally--is that the lights are turned on/off by a separate switch on the bottom of the mouse.  This wouldn't be a downside normally, except I find the switch to be quite a tight fit, and to turn them off requires you to flick the switch to the middle between the constant and touch-based functions, though hopefully this will slowly begin to wear in.All-in-all I am SO glad to have purchased this product; I was pleasantly surprised with how WAY over-the-top the mouse surpassed my expectations!  & for that I am glad, especially after having initially worried that I was going to have to shell out an absurd amount of money for the Logitech brands for life to appease my need for this type of mouse!  I can firmly say that I will gladly be buying from this brand--if not this specific model--again in the future and recommending it to my friends who work/play often on their computers!!",
    "Quick Note: the seller includes a sketchy usb stick to link you to a drop box to download the UI software and get some kind of reward for leaving a review.It's unnerving and you don't need to use it. You can go to the manufacturer website to download the same software file. I would recommend this just for best practice purposes.Battery Life: WowI game and work remotely so I'm using this mouse anywhere from 4-16 hours a day. I've had it for a few months now and I've charged it like 4 times. The battery life *if you don't have the lights on* is incredible. If you do have the lights on you'll see it goes idle after about 30s of inactivity (might be programmable in the UI, can't remember).Lights and Customization: Colorful and bright, but I don't use themI never use the lights, but they're cool. There's plenty of customization options but I remember being a little underwhelmed with the options, like you can't have it cycle through custom gradients, but the UI is extremely user friendly.Buttons and Macros: All I need and more, but a little tedious to reach.I remember before I got the mouse, reading a couple comments mentioning the thumb keys felt weird to press? I have had no such experience. Easy to press but not easy enough to accidentally press. Although, the back two rows aren't as easy to reach as the front two.Easy to setup keybindings or macros. You can get really creative with the macro settings. For work I created a \"Left Click, Home, Shift+End, CTRL+C\" to highlight and copy whatever line of text I'm hovering over in a single click.They've also got both a timed and untimed macro maker so you canOnly limitation is like 20 or 30 actions per macro (compared to Logitech which let's you bind entire sentences).In addition the trigger key (3 left clicks) is extremely useful and I use it soooo much more than I ever imagined I would.DPI and Accuracy: Hard to gauge?I'm not gonna say anything is off, but I feel like I'm having more trouble getting used to the mouse's acceleration and movement patterns more than with previous mice. Haven't had any issues playing ARPGs but in an FPS I'd definitely need to be quickly toggling between DPI settings.That said the DPI button is easily accessible for the index finger.Size, Shape, Weight: Comfy and sturdyNice wide mouse, shape is great, the tread on the wheel is nice, and it's easy to click from far forward to far back. My hands are fairly large, so I think my perfect mouse would be a slightly scaled up version of this mouse, but the shape and size should be great for all but the largest hands.The mouse has a good weight to it, makes steady movements easy, definitely feels like a sturdy device.",
    "TL;DR - Excellent mouse, far superior to the Redragon M811 PRO, highly recommended and best I've found. Would be 4-stars except for poor/cheap USB charging design which requires charging from a computer, NOT a regular charger, and is almost certainly the reason for *numerous* reviews stating their mouse won't charge.I bought this and the Redragon M811 PRO together as they are very similar and I wanted to try both to see which I preferred. I was looking for a replacement to my Logitech G602 which has cheap, crappy buttons (two of them have the same exact issue where the side buttons don't click well; Logitech quality is not good IMO).The main and most obvious differences in these mice are the side button layout and the shape and finish, both of which will be personal preference. I do somewhat like the side buttons on the M811, due to having the back/forward buttons separate and larger, but that also means two fewer buttons for other things, and so ultimately I find I prefer the Venus Pro. That said, both mice have the same issue with the smaller buttons, which is that there's nothing distinguishing them, like the raised bars on the F/J keys, so you have to feel your way around to know where you are. It's not terrible by any means, but there really should be some tactile differentiation between some of the buttons (technically there is, as the 5 and 8 buttons have bars on them, but they're so subtle they may as well not even be there). As for the finish, I personally prefer the rougher, grippier surface of the Venus Pro over the smooth, glossy surface of the M811. I find the Venus to be easier to grip and to just feel more secure in-hand. I also slightly prefer the shape/ergonomics of it, which I find fits my hand a bit better and also results in my accidentally right-clicking less, which I do much more with this mouse (could also be a difference in the pressure required to activate the top buttons) when using it off the mouse pad, e.g. on the chair arm.I initially used the Venus, then switched to the M811 for quite a while, and it just never quite felt as good, and when I finally switched back to the Venus, it instantly felt better. But the biggest reason I prefer the Venus, and why I got fed up with the M811 and quit using it completely, is that the range on that one is terrible, while the Venus does much better. With the dongles plugged into a hub on the underside of my desk, both mice would work fine on the mousepad directly over it, but if I used them on my closed laptop (on the lid) sitting next to the mousepad, the Venus would work just fine and the M811 would have trouble. This is with the receiver a mere 14-18\" away. And with the receivers plugged into the computer sitting just a few feet away (and plugged into the IO port, which is facing me and the mouse, and with no case to interfere, as the \"computer\" is currently set up as a test bench/open air system), the M811 was struggling immensely, to the point it was barely usable. The Venus, conversely, has almost no issues.One thing I like about this mouse (the M811 may be the same, but I didn't get around to testing it) is that the button configuration is stored in the mouse, so once configured on one computer, they will work the way you set them to on any other.One minor issue I've found with the Venus is that the scroll wheel (which sadly doesn't have tilt-clicking functionality, something I find to be uncommon which is very unfortunate) slides a bit from side-to-side, and I'll sometimes find that when I'm scrolling, it feels a bit gritty/stiff, and I have to slide it over to get that to go away. I'm not talking about the detents, as it has the \"clicky\" scrolling (another unfortunate missing feature is the inability to switch to smooth scrolling to make it easier to scroll very quickly), but rather a grittiness on top of that.The biggest issue, though, is with the charging. The reason I went so long using the other mouse wasn't just to give it a fair shake, but because I switched when this mouse died, and I couldn't get it to charge. I ended up contacting support after I tried two separate chargers and cables, and they suggested I charge it with the supplied cable plugged into a computer (to their credit, they responded quickly and assured me they would refund my money if it didn't work). I lost track of the cable, but I tried another one, this time plugged into the computer, whereas both my previous attempts were using regular chargers, and it worked. What this tells me is that they've designed the charging circuitry out of spec, and it requires signal/voltage on additional pins that isn't there with standard chargers. Considering the whole point of USB is to be *universal*, and that USB-C particularly is supposed to standardize the mess of chargers and cables, I find it extremely frustrating when companies cheap out and create products that *appear to be* standardized but in fact are not, and therefore require specific chargers or charging scenarios, all to save a few cents. This is the second USB-C device I've bought, thinking I could just charge it with any USB-C charger, that I've run into this issue with (and both are from Chinese companies). Furthermore, there are a LOT of negative reviews for this mouse saying the same thing, that it won't charge. How many people are wasting time and money on this, returning the mouse and/or buying a different one, leaving negative reviews, all for something as stupid as this, because the company not only didn't follow USB specifications but clearly aren't paying attention to reviews to see the issue and at least make it clearer to consumers what's going on (though, ideally, they should just *fix* the issue).So the Venus Pro is by no means perfect, but between it and the M811, there's just no contest, and it's the only mouse I've found that has the feature I want, particularly the multiple side buttons, and isn't plagued with bad reviews. If they would just fix the charging issue (I personally prefer peripherals, including mice, that use AAs so I can use rechargeables that I can swap out and instantly be back at full power, without having to deal with cords at all, but it seems they're moving away from that unfortunately) this would be a 4-star mouse. Adding tilt and smooth-scrolling functionality to the wheel, and improving the wheel so it doesn't shift side-to-side resulting in the grittiness when scrolling, as well as improving the side buttons with some sort of (better) tactile way of telling the buttons apart, it would easily be 5-stars.",
    "I just want to start this review by saying I don't play MMO's at all but play ARPGs, FPS, Strategy, and Roguelikes. After doing a ton of research on whether to get another \"gaming\" mouse or jump ship to a MMO Mouse, the Venus Pro seemed to be the right fit for me. My previous mouse was from Red Dragon and honestly their quality sucks and having only 2 buttons on the side of it just wasn't enough for certain games.The Venus Pro wireless is perfect as it gives you the mobility of a mobile mouse and the features of a MMO Mouse. I got this early December and I'm still getting used to it. I can say that the mouse is really comfortable even though I have slightly smaller than medium hands (Medium nitrite gloves fit me with looseness). Learning the additional 14 buttons or so is a challenge but have figured out a way to make it easier to learn. I only use the top row for shooters and make the same buttons crouch, melee, utility, etc. When playing strategy's, ARPGs, etc the additional buttons truly come in clutch and I love it! I'm still experimenting with mapping controls for certain games. Can we also take a moment to talk about how for once I can use a scroll wheel in shooters?! Like every other gaming mouse I had used before just over scrolls whenever I try swapping between primary and secondary weapons, but Venus Pro somehow fixes this issue and doesn't over scroll. However there isn't tilt scroll which is something I got used to when I got rid of all of my Razer products in 2021. The texture of the mouse feels really nice too and helps you know exactly what you're touching on the mouse. The side buttons do this in a different way by tilting the depth of each row so you know which row your thumb is on which is just genius design. The RGB is nice and not over the top.Did I mention this is my first wireless peripheral (outside of gamepads)? I was skeptical to go wireless but decided to give it a go anyways and to my surprise I do not feel any latency ever and the battery life is great. Unlike the wired version, there's no way to adjust the weight of this mouse. You'll have to get used to the weightyness. As someone that plays FPS, this was a challenge at first but I got used to lifting up the mouse during intense gaming moments (which I know this mouse isn't meant for) but SOMEHOW my aim feels a whole lot better with it. Almost feels like I'm super saiyan lmao and the last time something gave me this feeling was when I went from a 27hz TV to a 144hz gaming monitor.The only real drawback is the software. There's no real way to set key on your Keybaord as a button on the mouse, you'd have to create a 'macro' for this which does have a drawback. For example, I set the side #9 as key # 9, I've bound this action to crouch in my game but I can't hold crouch this way because I suppose it's a macro? Either way I just changed some bindings around and moved number 9 to a different side button on my keyboard to use for a dfiferent action. Also the first day I had the mouse and used the software, changing DPI mid game caused my game to tab out / frame lag in which I couldn't perform any actions for a second. I tried changing from windowed to fullscreen but same issue. The issue eventually went away but was annoying at first. I think the biggest flaw is really just the software which visually looks like it came from 2001. I rather have old looking software if it means getting a perfect mouse.So yeah I recommend this mouse as someone that had a Razer Baselisk and Red Dragon.PSA, the games I've played since getting this mouse: Path of Exile, The Finals, Modern Warfare 3, Age of Empires 4, Grim Dawn, Forza Motorsport, Risk of Rain Returns, Northgard."
  ]
}